package pages;

public class PageHelper {

    static String ArabicPara = "وبحلول وباستثناء تم فصل. وسوء أخرى لفرنسا ومن قد, وزارة لبلجيكا، تم أخذ! كل عُقر أدنى كلّ. إذ مكن عملية فرنسية المتّبعة, إذ دنو حقول نتيجة الأمور?\n" +
            "\n" +
            "لهذه غضون وإيطالي قبل في, الجو بمحاولة فقد هو, و ليبين المسرح هذه. يبق تعداد غرّة، في. أن به، العالم الصينية. حدى كل وجزر السيطرة لإنعدام, بل وتنامت الربيع، فقد, خلاف الأوضاع في كان?\n" +
            "\n" +
            "الأحمر بالعمل العالمي لم بحق, جُل الدول الأرضية ٣٠. ما يتمكن التكاليف ذلك, وحرمان المشتّتون عن تحت. ثم الصين وانتهاءً الأثناء، جعل. دنو الكونجرس ولكسمبورغ مع? إجلاء بتخصيص سليمان، جُل مع. جسيمة واستمر دون لم.\n" +
            "\n" +
            "مكن وسفن الدول يعادل ما, بين قد الهجوم الدنمارك. بهيئة تصرّف فاتّبع لان أي, عل دار نقطة فهرست الأرواح, ٢٠٠٤ أوسع أخذ ان. و غرّة، مكثّفة جعل! تلك الشهير وحلفاؤها بـ, اتفاق وتزويده للحكومة شيء في.\n" +
            "\n" +
            "كرسي أسابيع معارضة حين ما! ثم دنو يتعلّق الأثنان, عن وسوء مكثّفة الثالث، أخذ. أن الى ويعزى للإتحاد بالمطالبة, فقامت استمرار وباستثناء على تم! لم القوى ويتّفق لان, عن أسيا تطوير المبرمة ولم! بحق مسرح للصين إنطلاق في, تلك في وبدأت وعُرفت لليابان! منتصف إيطاليا فعل عن, تم حاول أكثر فقد! عرض مع تحرّك وصافرات المعاهدات, ولم بل ماشاء الصفحات?\n" +
            "\n" +
            "أما العاصمة الأسيوي بريطانيا، أي, احداث بأيدي في جعل? وسفن تعديل مشاركة قبل بـ, أن الجو إختار بمحاولة أما. ثمّة الشهيرة دون و. لعدم تصرّف بل بعض, التي العالم، ارتكبها هو هذا. يكن عن وزارة الساحة انتصارهم, كل لتقليعة الخارجية الأوروبية، هذه.\n" +
            "\n" +
            "ساعة بتحدّي الدّفاع إذ تحت. أي الضروري وبريطانيا ومن? غضون بالعمل استراليا، ما بال, لغات فمرّ التقليدي أم وصل. واشتدّت وايرلندا الأوربيين و تلك? لهذه لليابان والروسية في هذا, في وعُرفت البرية بولندا، حدى!\n" +
            "\n" +
            "تعداد يعادل تحت عل, مكن بل بهيئة وانتهاءً. يتم عل وجهان مشاركة, تحت ما حاول ومطالبة الإثنان. مع بمحاولة ماليزيا، أضف, كل تشكيل بمحاولة وبلجيكا، وصل, اتفاق ويكيبيديا ما ذات. يتم في تنفّس النفط العسكري, فمرّ مقاومة لبلجيكا، يبق أم! الدمج ضمنها في هذه, الطريق بريطانيا-فرنسا أي بعض. عرفها الأهداف حول أم, على شمال بتطويق الصينية لم, أسر بـ وقرى وبعدما الأبرياء!\n" +
            "\n" +
            "بل أسيا الإتفاقية انه. شرسة الضغوط اللازمة ٣٠ جعل. عن يتسنّى الشمال بريطانيا، كلّ, ووصف إجلاء وصافرات و وقد. عل يتم الأوروبي ويكيبيديا. دنو سليمان، واشتدّت هو, ٣٠ المدن العالمية لبولندا، نفس.\n" +
            "\n" +
            "و بخطوط قائمة إيطاليا عدد, عن بين بحشد أخرى, دار إذ فكان بالتوقيع. بل تزامناً العالمية حيث, وحرمان الدولارات تم كلا, ا المواد البرية بحق هو. ما عُقر الإقتصادي بين. تصرّف اكتوبر في الا, في أخرى والمانيا اقتصادية كلا!\n" +
            "\n" +
            "أن قامت الأول مكن, إذ ذلك ليبين وكسبت الجنود, جديداً وباستثناء مع قبل. قد بعض وسفن البشريةً! إذ أخذ وقامت ويتّفق. معقل لكون غضون مع جهة. أن المضي جديداً هذه!\n" +
            "\n" +
            "أن أخر وبدأت استطاعوا. و لتقليعة استرجاع مكن. ما أهّل بشرية وباءت به،, ما لدحر الأمريكي على, لان نتيجة إنطلاق قد. واُسدل والروسية تحت و.\n" +
            "\n" +
            "بقصف تعداد مهمّات لم ذات? بل الله واعتلاء وفي, بعض ثمّة والفلبين ان. لم كردة وحتّى أخر, أخرى فرنسا أي فعل. فمرّ قتيل، بـ جهة! دار بل دخول بقعة تمهيد, يتبقّ أعمال الثقيل إذ ولم, شيء ثم ووصف وشعار هاربر.\n" +
            "\n" +
            "الضروري الخاصّة وصل كل! الشطر بمباركة هو وتم. تحرّكت ايطاليا، لها بـ, بحق وأزيز الأمم تم! وقد ثم أوزار للسيطرة, و به، بفرض واستمرت والمانيا! كردة قررت هو بعض!\n" +
            "\n" +
            "دون ٢٠٠٤ الإمداد مع, جهة كرسي نتيجة مع. إذ عرض وقام بداية العالمية. بـ كلّ وترك لهذه وتزويده, لعدم الأمم الجديدة، إذ ذلك. تعد إذ فبعد وشعار المجتمع. أسر بـ لهذه الصعداء! وصل الأراضي الفرنسي عن. كلا سقطت وتتحمّل الإتفاقية من?\n" +
            "\n" +
            "علاقة الأوروبية، ثم به،, عن دون للسيطرة شموليةً التغييرات, هو انه بفرض ماذا غرّة،! جهة مع القادة بتحدّي ارتكبها, بقصف تصفح إذ على. مع أفاق أوراقهم يكن, هنا؟ الحدود الأمريكي عدم أي. وحتّى وإقامة ولم قد, كما كل اتّجة بأيدي لليابان. عل يتم واُسدل وبعدما.\n" +
            "\n" +
            "الهجوم الأولية انتصارهم ثم وتم, يكن تم هامش تعديل, عن لإعلان بتطويق واستمرت حيث. مرجع فمرّ حيث إذ? ذات السادس المنتصر مع, وحتى وتنصيب التخطيط به، تم. هو تلك مايو والكساد التاريخ،, الى كل أمدها مقاومة الإثنان. عل وجزر إنطلاق والفرنسي تلك, عن بقصف وتنامت والكوري كلّ, ساعة ماشاء أخر ان? كل أسر إعلان الطريق السيطرة. بحشد وترك الضغوط ومن أن, للمجهود والفلبين الولايات عدد ان.\n" +
            "\n" +
            "وتم أم وأكثرها وحلفاؤها الإمتعاض, أخرى مدينة بالولايات مكن عن! بين هو وحتى الأولى واندونيسيا،. قتيل، الخطّة الإحتفاظ عرض هو? أعلنت موالية و دون, فسقط لعدم ثم هذه, جُل أم وسوء السيء وتتحمّل? ثم أخر مسرح اعتداء سبتمبر! الأولى الهادي إذ كما, فصل يتعلّق الأرضية التكاليف أي, عقبت عملية انتهت ذات من?\n" +
            "\n" +
            "اتفاق لفرنسا إتفاقية ثم حتى, من دول بفرض صفحة! قد شرسة العالمية جهة, جدول شاسعة وباستثناء كلّ لم, أراضي وهولندا، ومن ٣٠. أي حتى كرسي الربيع،. على عل ألمّ تكبّد الأحمر, أي فقد تسبب ليبين والقرى! الصين المؤلّفة ضرب إذ, عقبت قِبل المشتّتون إذ على. هذه بل لهذه إتفاقية الأوضاع, الصعداء الصينية لتقليعة انه عن.\n" +
            "\n" +
            "تعد مرجع وإيطالي ٣٠! لم قائمة وقوعها، حدى, ٣٠ القوى مكثّفة بمحاولة ولم, حيث قبضتهم استعملت التكاليف بـ. بلا ما الآلاف البرية, حول سقطت الثقيل مع. لم الأول المبرمة أسر, وتم قد الأثنان الخارجية الدولارات, بقسوة الخارجية كلا في. أم ثمّة الإيطالية مما, فهرست الكونجرس كل نفس. الا من مكثّفة الضغوط, كما هو لغات إعمار المشتّتون?\n" +
            "\n" +
            "فقد الأحمر اليابان بريطانيا-فرنسا من. على بأيدي ولكسمبورغ تم, وبعدما التحالف وقد مع! ما بلا لعملة كثيرة الصينية, أضف من تمهيد انتباه. بها الشرقي معزّزة عل, وعلى معاملة الخاسرة تم لكل, أضف بقعة احداث وبغطاء أم.\n" +
            "\n" +
            "رئيس الدمج أي هذه. نفس الدمج واُسدل أي, أم بتطويق الخطّة ذات. لأداء وقوعها، الإقتصادية ٣٠ لان, بالحرب الإطلاق استراليا، وتم تم. مكّن السادس الأثناء، أسر ما. يتم تعديل كانتا بالمحور إذ, انه ماذا الشمال استرجاع عل! عل هذه إنطلاق الوزراء, فقد أوسع وانهاء وحلفاؤها عل, عدم بل أوزار الإنزال!\n" +
            "\n" +
            "وحتّى إعمار الساحة عن بعد. لكل الآخر الشرقية والكساد أي, حول مع زهاء أمدها, حلّت مساعدة عل عدم. بـ وتم الجوي الخاصّة, هناك الحيلولة أن قام. ان أحكم ألمانيا سنغافورة الا! أي الضغوط الشتوية بها. ٣٠ وأزيز مليارات بمعارضة إيو, انه في أمام السفن تحرّكت!\n" +
            "\n" +
            "تُصب اللا أفريقيا قام قد. على أطراف ليرتفع من, وحتى أخرى مشروط بحق في. قبل خلاف الدّفاع بالمحور ثم. في قبل مرجع الأحمر اكتوبر? الحرة واحدة ٣٠ أضف, حتى.";

    public static String arabicChar(int num) {
        return ArabicPara.subSequence(0, num).toString();
    }

}
